; -----------------------------------------------------------------------------
;
; Universal Extractor Language File / Finnish (suomi)
; Written for Universal Extractor 2.0.0
; Author: Teijo Sakkara <teijo-at-nettilinja.fi>, updated for version 2 by Jyrki Vesterinen
;
; Updating translations:
;   Before updating a translation, please make sure you have the current development version of
;   	Universal Extractor by enabling the 'Install beta updates' option in preferences and searching
;   	for updates by clicking 'Check for Updates' in the help menu.
; 	Make sure to read the messages titled 'Breaking changes' - which can be found at
;		https://github.com/Bioruebe/UniExtract2/issues/2 - for a list of changes to already translated
;   	terms. Please compare the affected translations with the always up-to-date English language file
;		and edit them to reflect the changes.
;
; Translation Instructions:
;	Copy this file to a new file named after the new language
;		Eg: A language file for the German language would be named German.ini.
;	Replace the English words and phrases with their native equivalents,
;		attempting to match the English phrasing and case-sensitivity as
;		closely as possible for the sake of consistency
;	Update the Author and Homepage information at the top of your new language
;		file. Simply delete the Homepage line if you don't have one. Credit
;		yourself in the ABOUT_INFO_LABEL term if you want to.
;	Save the file in Unicode format (UTF-16/UCS-2 Little Endian) and send it to the developers -
;		via Github: https://github.com/Bioruebe/UniExtract2/issues/2 or
;		per e-mail to the address listed at https://bioruebe.com/contact/
;
;	The following symbols have special meanings:
;	& 		  - when used in a GUI label or button, it precedes the letter that will be registered
;				as a hotkey. Each letter should only be used once per menu.
;	%name	  - will be replaced with 'Universal Extractor'
;	%n	 	  - indicates a newline character
;	%t	  	  - indicates a tab character
;	%1,%2,... - indicates a string variable that UniExtract will replace
;		The content of each %1,... variable is hardcoded into UniExtract.
;		The numbered variables' order can be switched to fit your language's word order
;
; -----------------------------------------------------------------------------

[UniExtract]
; GUI labels and buttons
OK_BUT = "&OK"
CANCEL_BUT = "&Peruuta"
YES_BUT = "&Kyllä"
NO_BUT = "&Ei"
DELETE_BUT = "&Poista"
COPY_BUT = "&Kopioi"
BATCH_BUT = "&Eräajo"
SEND_BUT = "&Lähetä"
NEXT_BUT = "Seuraava >"
PREV_BUT = "< Edellinen"
CLOSE_BUT = ""
EXIT_BUT = "Sulje"
CONTINUE_BUT = "&Jatka"
FINISH_BUT = "Valmis"
ALWAYS_BUT = "&Aina"
NEVER_BUT = "Ei ko&skaan"
CHECKBOX_REMEMBER = "Älä kysy uudelleen"
CHECKBOX_DONT_ASK_AGAIN = ""
MAIN_DEST_DIR_LABEL = "&Kohdekansio:"
MAIN_FILE_LABEL = "Paketti tai &asennusohjelma:"
MAIN_DIRECTORY_LOCK = "lukitse"
MAIN_DIRECTORY_LOCK_TOOLTIP = "Estää automaattisen kohdekansion valitsemisen.%nTästä on hyötyä esimerkiksi jos haluat purkaa%neräajolla useita tiedostoja samaan kansioon."
MENU_FILE_LABEL = "&Tiedosto"
MENU_FILE_OPEN_LABEL = "&Avaa…"
MENU_FILE_KEEP_OPEN_LABEL = "&Pidä %name auki"
MENU_FILE_SHOW_LABEL = "Näytä &eräajojono"
MENU_FILE_CLEAR_LABEL = "&Tyhjennä eräajojono"
MENU_FILE_LOG_OPEN_LABEL = "Avaa &uusin lokitiedosto"
MENU_FILE_LOG_FOLDER_OPEN_LABEL = "Avaa loki&hakemisto"
MENU_FILE_LOG_LABEL = "P&oista lokitiedostot (%1)"
MENU_FILE_QUIT_LABEL = "&Lopeta"
MENU_EDIT_LABEL = "&Muokkaa"
MENU_EDIT_SILENT_MODE_LABEL = "&Hiljainen tila"
MENU_EDIT_PASSWORD_LABEL = "&Salasanaluettelo"
MENU_EDIT_CONTEXT_LABEL = "&Kontekstivalikko"
MENU_EDIT_PREFS_LABEL = "&Asetukset"
MENU_HELP_LABEL = "&Ohje"
MENU_HELP_FEEDBACK_LABEL = "&Anna palautetta"
MENU_HELP_PLUGINS_LABEL = "&Pluginhallinta"
MENU_HELP_UPDATE_LABEL = "&Tarkista päivitykset"
MENU_HELP_WEB_LABEL = "%1 &Kotisivut (www)"
MENU_HELP_GITHUB_LABEL = "%name &GitHubissa"
MENU_HELP_STATS_LABEL = "Ti&lastot"
MENU_HELP_PROGDIR_LABEL = "Avaa ohjelman &hakemisto"
MENU_HELP_CONFIGFILE_LABEL = "Avaa a&setustiedosto"
MENU_HELP_ABOUT_LABEL = "T&ietoja"
PREFS_TITLE_LABEL = "Asetukset"
PREFS_UNIEXTRACT_OPTS_LABEL = "Yleistä"
PREFS_HISTORY_LABEL = "Muista tiedostohistoria"
PREFS_UPDATEINTERVAL_LABEL = "Tarkista päivitykset:"
PREFS_UPDATE_DAILY = "päivittäin"
PREFS_UPDATE_WEEKLY = "viikoittain"
PREFS_UPDATE_MONTHLY = "kuukausittain"
PREFS_UPDATE_YEARLY = "vuosittain"
PREFS_UPDATE_NEVER = "ei koskaan"
PREFS_UPDATE_CUSTOM = "%1 päivän välein"
PREFS_FORMAT_OPTS_LABEL = "Lisäasetukset"
PREFS_LANG_LABEL = "&Kieli:"
PREFS_WARN_EXECUTE_LABEL = "Varoita ennen suoritusta"
PREFS_WARN_EXECUTE_TOOLTIP = "Jotkin purkumenetelmät edellyttävät tiedoston suorittamista, joka voi olla vaarallista, erityisesti jos käytät ohjelmaa haittaohjelmien tutkimiseen.%nJos tämä asetus on päällä, %name varoittaa ennen kuin suorittaa tiedoston."
PREFS_CHECK_FREE_SPACE_LABEL = "Tarkista vapaa tila"
PREFS_CHECK_FREE_SPACE_TOOLTIP = "Tarkista ennen purkamista, että levytilaa on tarpeeksi"
PREFS_CHECK_UNICODE_LABEL = "Tarkista Unicode-merkit"
PREFS_CHECK_UNICODE_TOOLTIP = "Jotkin erikoismerkit (esimerkiksi japaninkieliset merkit) voivat aiheuttaa ongelmia purkaessa.%nJos sellaisia merkkejä sisältävien tiedostojen purkaminen ei onnistu, tämä asetus saa ohjelman uudelleennimeämään ne väliaikaisesti."
PREFS_APPEND_EXT_LABEL = "&Korjaa tiedostopäätteet"
PREFS_APPEND_EXT_TOOLTIP = "Korjaa puuttuvat ja väärät tiedostopäätteet."
PREFS_HIDE_TRAY_LABEL = ""
PREFS_HIDE_STATUS_LABEL = "Ei tilaikkunaa"
PREFS_HIDE_STATUS_FULLSCREEN_LABEL = "Piilota tilaikkuna kokoruututilassa"
PREFS_HIDE_STATUS_FULLSCREEN_TOOLTIP = "Pelitila: poistaa tilaikkunan käytöstä, kun pelaat peliä tai käytät jotakin muuta ohjelmaa kokoruututilassa."
PREFS_OPEN_FOLDER_LABEL = "Näytä lopuksi puretut tiedostot"
PREFS_FEEDBACK_PROMPT_LABEL = "Kysy palautetta"
PREFS_FEEDBACK_PROMPT_TOOLTIP = "Jos tämä asetus on päällä, %name avaa ikkunan, joka pyytää lähettämään palautetta kehittäjälle, jos tiedoston purku ei onnistu."
PREFS_WINDOW_POSITION_LABEL = "Muista ikkunan koko ja sijainti"
PREFS_SEND_STATS_LABEL = "Lähetä käyttötilastoja"
PREFS_SEND_STATS_TOOLTIP = "Lähetä tilastotietoja (mitä tiedostomuotoja purat eniten, mitä asetuksia käytät, satunnaisgeneroitu käyttäjä-ID;%ntiedostonimiä tai muuta potentiaalisesti arkaluontoista informaatiota ei kerätä).%nNäin tiedämme Universal Extractorin suosituimmat ominaisuudet ja voimme keskittyä niiden kehittämiseen."
PREFS_LOG_LABEL = "Luo lokitiedostoja"
PREFS_VIDEOTRACK_LABEL = "Pura videoraidat"
PREFS_VIDEOTRACK_TOOLTIP = "Jos tämä asetus on pois päältä, %name ohittaa videoraidat purkaessaan videotiedostoja.%nJos tarvitset vain ääniraidan, tämä säästää aikaa ja levytilaa."
PREFS_TOPMOST_LABEL = "Pidä ikkuna p&äällimmäisenä"
PREFS_BETA_UPDATES_LABEL = "Päivitä betaversioihin"
PREFS_SOURCE_FILES_LABEL = "Alkuperäiset tiedostot"
PREFS_SOURCE_FILES_OPT_ASK = "kysy"
PREFS_SOURCE_FILES_OPT_DELETE = "poista"
PREFS_SOURCE_FILES_OPT_KEEP = "säilytä"
PREFS_SOURCE_FILES_OPT_KEEP_TOOLTIP = "Kysy, pitäisikö alkuperäiset tiedostot poistaa vai säilyttää."
PREFS_DELETE_ADDITIONAL_FILES_LABEL = "Poista turhat tiedostot"
PREFS_DELETE_ADDITIONAL_FILES_TOOLTIP = "%name suodattaa puretut tiedostot ja siirtää tunnetut hyödyttömät tiedostot '%1'-kansioon.%nTäällä voit valita poistaa tiedostot sen sijaan."
FEEDBACK_TITLE_LABEL = "Anna palautetta"
FEEDBACK_SYSINFO_LABEL = "Järjestelmätiedot:"
FEEDBACK_OUTPUT_LABEL = "Universal Extractorin antamat tiedot:"
FEEDBACK_MESSAGE_LABEL = "Viesti/lisätietoja:"
FEEDBACK_PRIVACY_ACCEPT_LABEL = "Hyväksyn tietosuojakäytännön"
FEEDBACK_PRIVACY_VIEW_LABEL = "Tietosuojakäytäntö"
CONTEXT_ENTRIES_LABEL = "Kontekstivalikko"
CONTEXT_ENABLED_LABEL = "käytössä"
CONTEXT_ALL_USERS_LABEL = "kaikilla käyttäjillä"
CONTEXT_ADMIN_REQUIRED = "Tämä asetus vaatii järjestelmänvalvojan oikeudet"
CONTEXT_FILE_ASSOC_LABEL = "Tiedostosidokset"
CONTEXT_SIMPLE_RADIO = "päätasolla"
CONTEXT_CASCADING_RADIO = "alivalikossa"
CONTEXT_CASCADING_RADIO_TOOLTIP = "Tämä asetus ei toimi Windows XP:llä eikä Vistalla"
UPDATE_ACTION_INSTALL = "Päivitä"
UPDATE_STATUS_SEARCHING = "Etsitään päivityksiä..."
UPDATE_TERM_PROGRAM_FILES = "purkuohjelmat"
UPDATE_WHATS_NEW = "Mitä uutta"
FIRSTSTART_TITLE = "T&ervetuloa Universal Extractoriin"
FIRSTSTART_PAGES = "Tervetuloa|Asetukset|Kontekstivalikko"
FIRSTSTART_PAGE1 = "Tervetuloa Universal Extractoriin.%n%nKäytä hetki Universal Extractorin säätämiseen mieleiseksesi.%n%nMutta ensin lakijuttuja.%nTämä ohjelmisto on tarjottu saataville 'sellaisena kuin se on' ilman mitään takuuta. Käytä sitä omalla vastuullasi. Universal Extractorin kehittäjät eivät ole vastuussa mistään vahingoista, jotka johtuvat tämän ohjelmiston käytöstä. Käyttämällä Universal Extractoria hyväksyt käyttäväsi sitä vain tarkoituksiin, jotka ovat laillisia sekä paikallisten että kansainvälisten lakien mukaan. Ellet hyväksy käyttöehtoja, et saa käyttää Universal Extractoria."
FIRSTSTART_PAGE2 = "Valitse ensin yleiset asetukset, jotka ohjaavat tiedostojen purkamista ja Universal Extractorin yleistä toimintaa.%n%nKaikkiin näihin asetuksiin pääsee myöhemmin käsiksi valikosta."
FIRSTSTART_PAGE3 = "%name voi lisätä itsensä järjestelmän kontekstivalikkoon. Sen jälkeen tiedoston voi purkaa tai tietoa tiedoston tyypistä voi tarkastella yksinkertaisesti klikkaamalla mitä tahansa tiedostoa hiiren kakkospainikkeella, avaamatta Universal Extractoria ensin. Valitse, mitkä toiminnot pitäisi näyttää kontekstivalikossa.%n%nKaikkiin näihin asetuksiin pääsee myöhemmin käsiksi valikosta."
FFMPEG_LICENSE_ACCEPT_LABEL = "Olen lukenut lisenssiehdot ja hyväksyn ne"
FFMPEG_LICENSE_VIEW_LABEL = "Näytä lisenssiehdot"
FFMPEG_SELECT_LABEL = "Minulla on jo FFmpeg"
FFMPEG_SELECT_TITLE = "Valitse FFmpeg"
STATS_HEADER_STATUS = "Tulosjakauma"
STATS_HEADER_TYPE = "Purkukerrat tiedostotyypin mukaan"
STATS_STATUS_SUCCESS = "Onnistui"
STATS_STATUS_FAILED = "Epäonnistui"
STATS_STATUS_FILEINFO = "Tiedoston skannaus"
STATS_STATUS_UNKNOWN = "Tuntematon tiedostotyyppi"
STATS_NO_DATA = "Tilastoruutua varten ei ole vielä tarpeeksi tietoja.%n%nYritä myöhemmin uudelleen."
FILESCAN_TITLE = "Skannauksen lopputulos:"
ABOUT_INFO_LABEL = "Alkuperäinen versio: %1%nVersio 2.0.0: Bioruebe <%2>%nVersio %3: gvp9000%n%nSuomenkielinen käännös: Teijo Sakkara/Jyrki Vesterinen%n%nJulkaistu lisenssillä %4"
ABOUT_VERSION = "Versio %1 (%2)"
METHOD_ADMIN_RADIO = "%1 Järjestelmänvalvojan asennus"
METHOD_EXTRACTION_RADIO = "%1 purkaminen"
METHOD_HEADER = "%1 -paketin purku"
METHOD_RADIO_LABEL = "Purkumenetelmä"
METHOD_SWITCH_RADIO = "%1 valintakytkimellä"
METHOD_NOT_INSTALLER_RADIO = ""
METHOD_TEXT_LABEL = "%name tukee seuraavanlaisia menetelmiä purkaa %1 -paketteja. Valitettavasti mikään menetelmistä ei ole 100% luotettava. Jollei oletustapa näytä toimivan, suorita uudestaan %name ja valitse toinen purkumenetelmä."
METHOD_UNPACKER_RADIO = "%1 Purkaaja"
METHOD_GAME_LABEL = "Tiedosto %1 on ilmeisesti jonkin pelin arkisto. %name voi purkaa monenlaisia peliarkistoja, mutta ei tiedä, mihin peliin tämä arkisto kuuluu. Jos tiedosto on peliarkisto, valitse oikea peli alla olevasta luettelosta. Muuten valitse '%2' tai paina '%3' yrittääksesi purkaa tiedoston toisella menetelmällä."
METHOD_GAME_NOGAME = "Ei mikään peli tällä listalla"
METHOD_NOT_IN_LIST = "Ei yksikään näistä"
METHOD_FILE_SELECT_LABEL = "Tiedoston %1 purkamiseen tarvitaan toinen tiedosto, mutta %name ei tiedä, mikä niistä.%n%nValitse yksi allaolevista vaihtoehdoista. Ellei purkaminen toimi oikein, yritä uudelleen ja valitse toinen tiedosto."
METHOD_EXTRACTOR_SELECT_LABEL = "%nAlla on kaikkien Universal Extractorin tukemien purkajien/tiedostotyyppien lyhenteet.%n%nValitse käytettävä purkaja, tai valitse '%2' tunnistaaksesi tiedostotyypin automaattisesti samoin kuin %name toimii normaalisti."

; GUI control functions
EXTRACT_TO = "Purkaa kohteeseen"
OPEN_FILE = "Avaa tiedosto"
SELECT_FILE = "Valitse tiedosto"
UPDATE_CURRENT = "Sinulla on uusin versio Universal Extractorista."

; Common terms
TERM_ARCHIVE = "paketti"
TERM_AUDIO = "ääni"
TERM_COMPILED = "käännetty"
TERM_COMPRESSED = "pakattu tiedosto"
TERM_CONTAINER = "tiedosto"
TERM_DATABASE = "tietokanta"
TERM_DISK_IMAGE = ""
TERM_DOWNLOAD = "Lataa"
TERM_DOWNLOADING = "Ladataan"
TERM_EBOOK = "eBook"
TERM_ECARD = "eCard"
TERM_ENCODED = "koodattu tiedosto"
TERM_ENCRYPTED = "salattu tiedosto"
TERM_ERROR = "virhe"
TERM_EXECUTABLE = "ohjelmatiedosto"
TERM_EXTRACT = "pura"
TERM_FILE = "tiedosto"
TERM_GAME = "peli"
TERM_HELP = "ohjetiedosto"
TERM_HOTFIX = "hotfix"
TERM_IMAGE = "levykuva"
TERM_INSTALLED = "Asennettu"
TERM_INSTALLER = "asennusohjelma"
TERM_LOADING = "Ladataan..."
TERM_MERGE_MODULE = "yhdistettävä moduuli"
TERM_OVERALL_PROGRESS = "Edistyminen"
TERM_PACKAGE = "paketti"
TERM_PAGE = "sivu"
TERM_PATCH = "korjauspäivitys"
TERM_RECONSTRUCTED = "uudelleen koottu"
TERM_SCAN = "skannaa"
TERM_SCRIPT = "skripti"
TERM_SFX = "itsepurkautuva"
TERM_STAGE = "vaihe"
TERM_TESTING = "testataan"
TERM_TRANSLATION = "käännöstiedosto"
TERM_UNKNOWN = "tuntematon"
TERM_UNPACKED = "pakkaamaton"
TERM_UPDATER = "päivitysohjelma"
TERM_VIDEO = "video"

; Status messages
SCANNING_FILE = "Tutkitaan tiedostoa %1:n avulla"
SCANNING_EXE = "Tutkitaan tiedostoa %1:n avulla"
EXTRACTING = "Puretaan kohde:"
INIT_WAIT = "Asennusohjelma käynnistyy.%nOdota."
SENDING_FEEDBACK = "Lähetetään palautetta"
INPUT_NEEDED = "Syötettä tarvitaan"
SEARCHING_PASSWORD = "Yritetään selvittää salasanaa"
TESTING_PASSWORD = "Kokeillaan salasanoja (%1/%2)"
MOVING_FILE = "Siirretään hakemistoon"
RENAMING_FILES = "Uudelleennimetään tiedostoja (%1/%2)"
RENAMING_FILES_PROGRESS = ""
PROCESSING = ""
CLEANING_UP = ""

; Custom prompts
INIT_COMPLETE = "Alustetaan '%1'.  Sulje asennusohjelma ja paina OK jatkaaksesi."
UNPACK_PROMPT = "Tiedosto on pakattu käyttäen %1 pakkausta, mutta sen purku epäonnistui.%nTämä voi johtua tukemattomasta tiedostomuodosta tai siitä%nettä pakettitiedostossa ei ole mitään purettavia tiedostoja.%n%nAvataanko tiedosto purkamisen sijaan?%n%nHuom! Avattu tiedosto nimetään seuraavasti:%n'%2\'%3_unpacked.%4'"
UNPACK_FAILED = "VIRHE: %1%nei voida purkaa."
UNPACK_AGAIN = "%1 purettu.%n%nHaluatko Universal Extractorin yrittävän tiedoston %2 purkamista?"
NSIS_BINFILES = "%1 purettu.%nKuitenkin, samassa hakemistossa kuin tiedosto %2 on data.bin-tiedostoja. Ne voivat kuulua asennustiedostoihin.%n%nPaina OK, jos haluat purkaa ne, tai Peruuta, jos et halua."
WARN_EXECUTE = "VAROITUS:  Tämäntyyppisten tiedostojen purkamiseksi ne pitää suorittaa.%nJos jatkat, suoritetaan seuraavanlainen komento:%n%n%1%n%nJos epäilet tiedoston sisältävän haittaohjelmistoja tai viruksia, ei ole suositeltavaa jatkaa.%nJatketaanko?"
FEEDBACK_SUCCESS = "Kiitos palautteesta. Käsittelemme viestisi pian."
FEEDBACK_PROMPT = "Universal Extractorin kehittämiseksi voit kertoa kehittäjille ongelmista.%nPurkulokit sisältävät arvokasta tietoa tiedostosta ja mahdollisista virheistä, jotka ovat voineet ilmetä purkamisen aikana.%n%nHaluatko avata palauteikkunan?"
FEEDBACK_PRIVACY = "Huomio tietosuojasta: palautetiedostot säilytetään palvelimillamme, kunnes kehittäjä käsittelee ja poistaa ne. Tietoja ei jaeta kolmansien osapuolien kanssa. Voit lähettää sähköpostia milloin tahansa pyytääksesi tietojen poistamista.%n%nLokissa olevat tiedot voivat sisältää tietoja tietokoneestasi ja tiedoston sisällöstä. Ellet halua lähettää jotakin tietoa, poista se.%n%nHyväksytkö tämän tietosuojalausekkeen ja haluatko lähettää viestin? Jos vastaat ei, mitään ei lähetetä."
FEEDBACK_OUTDATED = "Varoitus: käytät vanhaa versiota Universal Extractorista.%n%nEnnen kuin ilmoitat ongelmasta, varmista, että se on yhä mukana uusimmassa versiossa. Kiitos!"
FFMPEG_NEEDED = "%1 vaikuttaa videotiedostolta.%n%nVoidakseen purkaa video- ja ääniraidat, %name tarvitsee FFmpegin. Paina %2-painiketta, ja ohjelma lataa ja asentaa kaiken tarpeellisen automaattisesti."
PROGRAM_FILES_MISSING = ""
PLUGIN_MISSING = "Tiedoston %1 purkamiseen tarvitaan apuohjelma.%n%nAvaa pluginhallinta alla olevalla painikkeella ja lataa valittu apumoduuli. Käytä sitten '%2'-painiketta asentaaksesi sen Universal Extractoriin. Purkaminen jatkuu, kun olet sulkenut pluginhallinnan."
UPDATE_PROMPT = "Uusi versio %1:sta on saatavilla.%n%nHaluatko ladata uuden version nyt?"
FILE_COPY = "Tiedoston %1 käsittely edellyttää sen kopiointia ensin. Se voi viedä jonkin aikaa riippuen tiedoston koosta.%n%nVarmista, että levytilaa on tarpeeksi, ja paina OK jatkaaksesi."
FILE_DELETE = "%1 purettu. Haluatko poistaa alkuperäisen tiedoston?%n%nHuom: on mahdollista, etteivät puretut tiedostot ole käyttökelpoisia. Paina 'kyllä' vain jos olet varma, että purkaminen sujui kuten piti.%n(Tämän viestin voi ottaa pois käytöstä asetuksista.)"
BATCH_DUPLICATE = "Tiedosto %1 on jo eräajojonossa.%n%nPitäisikö se lisätä jonoon uudelleen, eli purkaa kahdesti?"
NO_FREE_SPACE = "Varoitus:%nKohdelevyllä %1 on vähemmän vapaata tilaa kuin lähdetiedoston koko.%n%nVapaa tila:%t%2 Mt%nTarvittava tila:%t>%3 Mt%nErotus: %t~%4 Mt"
CONTEXT_DANGEROUS = "Varoitus:%nTiedostosidosten muuttaminen voi olla vaarallista. Esimerkiksi .exe-tiedostojen sidoksen muuttaminen voi estää ohjelmien suorittamisen kokonaan. Huolehdi, että tiedät, mitä olet tekemässä.%n%nHaluatko varmasti jatkaa?"
ELEVATION_REQUIRED = "Toimenpide estettiin.%n%n%name käynnistyy nyt uudelleen korotettuna. Yritä uudelleen sen jälkeen."
ACCESS_DENIED = "Toimenpide estettiin.%n%n%name on jo korotettu. Varmista, että sinulla on tarvittavat oikeudet, ja yritä uudelleen."
MOVE_FAILED = "Tiedostoa %1 ei voitu kopioida polkuun %2. Jos polussa tai tiedostonimessä on erikoismerkkejä, yritä uudelleennimetä tiedosto tai siirtää se kansioon, jolla on tavallinen nimi. Sillä tavalla Universal Extractorin ei tarvitse kopioida tiedostoa tilapäiseen hakemistoon. Yritä sitten uudelleen."

; Help text
HELP_TITLE = ""
HELP_USAGE_TITLE = ""
HELP_USAGE = ""
HELP_ARGUMENTS = "%n%nTuetut argumentit:"
HELP_SCAN = "%n     %1%t%tAntaa tietoa tiedoston tyypistä"
HELP_FILENAME = "%n     tiedostonimi%tPurettavan tiedoston nimi"
HELP_DESTINATION = "%n     kohdekansio%tKansio johon puretaan"
HELP_SILENT = "%n     %1%t%tHiljainen tila (ei kysy mitään)"
HELP_BATCH = "%n     %1%t%tLisää tiedoston eräajojonoon"
HELP_TYPE = ""
HELP_SUB = "%n%nKäytettäessä kohdekansion tilalla %1 %name luo%npakatun tiedoston nimisen alikansion, johon tiedosto puretaan; "
HELP_LAST = "käytettäessä %1 se käyttää viimeksi käyttämääsi kohdekansiota."
HELP_NOARGS = "%n%nSuoritettaessa %name ilman argumentteja %nkäyttäjältä kysytään tiedostonimi ja kohdekansio."
HELP_MORE = ""
HELP_EXAMPLE_TITLE = ""
HELP_EXAMPLE = ""
HELP_DOCS_LINK = ""

; Warning messages
WARN_CONVERSION_FAILED = ""
WARN_MOVE_FAILED = ""

; Error messages
UNKNOWN_FILETYPE_TITLE = "Tuntematon tiedostotyyppi"
UNKNOWN_FILETYPE = "'%1' ei voitu purkaa.%n%nJos sinulla on tietoja tiedostotyypistä, ota meihin yhteyttä palautelomakkeella."
INVALID_FILE = "Purettavaa tiedostoa%n%n%1%nei löytynyt. Syötä kelvollinen tiedostonimi.%n%n%1"
INVALID_DIR = "%1%nei voitu luoda. Sinulla ei ehkä ole oikeuksia kirjoittaa kohdekansioon.%n%nValitse kelvollinen kohdekansio tai kokeile suorittaa %name järjestelmänvalvojan oikeuksilla."
NO_HISTORY = "%1 ei voitu purkaa.%nViimeksi käytettyä kansiota ei ole asetettu.%n%nVarmista, että '%2' on käytössä ja olet purkanut ainakin yhden tiedoston ennen kuin yrität purkaa viimeksi käytettyyn kansioon."
EXTRACT_FAILED = "%1 ei voitu purkaa.%nTiedoston tunnistettiin olevan %2. Purkaminen epäonnistui vaikka pakkausmuoto onkin tuettu.%n%nHaluatko, että %name luo ja näyttää lokitiedoston, jossa on lisätietoja?"
NOT_PACKED = "%1 ei voitu purkaa, tiedosto ei ole pakattu vaan %n%n%2"
DOWNLOAD_FAILED = "Tiedostoa %1 ei voitu ladata. Varmista, että olet yhteydessä Internetiin ja yritä sitten uudelleen."
UPDATECHECK_FAILED = "Päivitystarkitus epäonnistui. Varmista, että olet yhteydessä Internetiin ja yritä sitten uudelleen."
UPDATE_FAILED = "Joidenkin tiedostojen päivitys epäonnistui.%n%nYritä myöhemmin uudelleen tai lataa uusi versio Universal Extractorista."
UPDATE_NOADMIN = "%name ei saanut järjestelmänvalvojan oikeuksia.%n%nKlikkaa Universal Extractorin kuvaketta hiiren kakkospainikkeella, valitse 'Suorita järjestelmänvalvojana' ja etsi sitten uudelleen päivityksiä ohjevalikon kautta."
FFMPEG_MOVE_FAILED = "FFmpegiä ei voitu asentaa oikein. Klikkaa Universal Extractorin kuvaketta hiiren kakkospainikkeella, valitse 'Suorita järjestelmänvalvojana' ja yritä uudelleen."
FFMPEG_INVALID_FILE = "Valitsemasi tiedosto ei ole tuettu FFmpeg-versio.%n%nFFmpegistä on kaksi versiota: toinen on iso EXE ('staattinen') ja toinen on kansio, joka sisältää pienen EXEn ja monia DLL-tiedostoja ('jaettu'). %name tukee vain ensimmäistä."
FEEDBACK_EMPTY = "Yritä antaa mahdollisimman paljon tietoa varmistaaksesi, että palautteesi voidaan käsitellä nopeasti."
FEEDBACK_ERROR = "Palautteen lähettäminen epäonnistui. Yritä myöhemmin uudelleen tai lähetä ilmoituksesi sähköpostilla tai GitHubissa. Kiitos.%n%nVirhe: %1"
FEEDBACK_PRIVACY_NOT_ACCETPED = "Lähettääksesi palautetta sinun täytyy hyväksyä tietosuojakäytäntö."
LICENSE_NOT_ACCEPTED = "Hyväksy käyttöehdot jatkaaksesi."
BATCH_FINISH = "Eräajo valmistui, mutta kaikkien tiedostojen purkaminen ei onnistunut. Seuraavien tiedostojen purkuyritys aiheutti virheen:%n%n%1%nLisätietoja on asiaan kuuluvissa tiedostoissa lokihakemistossa (vain jos loki on käytössä)."
NOT_SUPPORTED_TITLE = "Tiedostotyyppiä ei tueta"
NOT_SUPPORTED = "%1 ei voitu purkaa.%n%n%name ei tue tiedoston tyyppiä.%n%nJos tiedät purkumenetelmän, lähetä meille viesti, niin autat meitä tekemään Universal Extractorista entistäkin paremman."
MISSING_EXE = "%1 ei voitu purkaa.%n%nApumoduulia %2 ei löytynyt."
EXTRACT_TIMEOUT = "%1 ei voitu purkaa.%n%nAikakatkaisu. Purkaminen saattaa onnistua yrittämällä uudelleen."
WRONG_PASSWORD = "%1 ei voitu purkaa.%n%nTiedosto on salasanasuojattu, ja antamasi salasana on väärä.%n%nVihje: käytä sisäänrakennettua salasanan selvittämistä. Se käyttää salasanaluetteloa, jota voit muokata %2-valikon kautta."
NO_FREE_SPACE_ERROR = "%1 ei voitu purkaa.%n%nKohdelevyllä ei ole tarpeeksi tilaa. Vapauta tilaa ja yritä uudelleen."
MISSING_PART = "%1 ei voitu purkaa.%n%nArkisto koostuu useista tiedostoista. Kaikki tarvitaan purkamiseen, mutta osaa niistä ei löytynyt.%n%nVarmista, että kaikki tiedostot ovat samassa kansiossa ja yritä sitten uudelleen."
PLUGIN_IMPORT_MISSINGFILES = "Pluginin %1 tuonti epäonnistui.%n%nEt valinnut kaikkia tiedostoja. Yritä uudelleen ja valitse kaikki alla olevat tiedostot:%n%n%2"
MISSING_DEFINITION = "%1 ei voitu purkaa.%n%nMääritystiedostoa %2 ei löytynyt.%n%nJos se on plugin, varmista, että olet asentanut sen oikein."
OPEN_URL_FAILED = "%name ei voinut avata linkkiä.%n%nSyötä seuraava URL haluamaasi WWW-selaimeen:"

; Plugin descriptions
PLUGIN_SUPPORTED_FILETYPES = "Tuetut tiedostotyypit:"
PLUGIN_ARC_CONV = "Purkaja useiden pelien arkistoille"
PLUGIN_ISCAB = "InstallShield-asennusohjelman osa, jolla voi purkaa CAB-tiedostoja. Se voi toimia paremmin kuin Universal Extractorin yleinen purkutuki, mutta se ei ole ilmainen."
PLUGIN_THINSTALL = "Purkaja ohjelmille, jotka on tehty siirrettäviksi VMware ThinAppin avulla"
PLUGIN_UNREAL = "Purkaja Unreal-pelimoottorin tukemille arkistoille"
PLUGIN_WINTERMUTE = "Purkaja Wintermute-pelimoottorin tukemille arkistoille"
PLUGIN_CI = "Purkaja CreateInstall-asennusohjelmille. Lataa, asenna ja kopioi tiedostot %1, %2 ja %3 \bin-hakemistoon"
PLUGIN_DGCA = "Purkaja DGCA-arkistoille"
PLUGIN_BOOTIMG = "Purkaja Androidin käynnistyslevykuville"
PLUGIN_IS5COMP = "Purkaja vanhoille InstallShield-asennusohjelman CAB-tiedostoille"
PLUGIN_WOLF = ""
PLUGIN_EXTSIS = "Purkaja uudemmille Symbian-käyttöjärjestelmäpaketeille"
PLUGIN_BITROCK = ""

; Context Menu integration
EXTRACT_FILES = "&Avaa UniExtractorilla..."
EXTRACT_HERE = "Pura UniExtractorilla &tänne"
EXTRACT_SUB = "Pura UniExtractorilla ali&kansioon"
EXTRACT_LAST = "Pura UniExtractorilla &viime kansioon"
SCAN_FILE = "&Selvitä tyyppi"

; Other
DIR_ADDITIONAL_FILES = "Ylimääräiset tiedostot"

; Uninstaller
UNINSTALL = ""
UNINSTALL_TITLE = ""
UNINSTALL_LABEL = ""
UNINSTALL_REMOVE_LOGS = ""
UNINSTALL_REMOVE_USERDATA = ""
